bot_token = '6106225915:AAHnu2uBWMHvmHFCRlB0vsGc8VSmlZoDO24'
weather_api_key="8c1a7edcfc640b8f49399b5c116fe98e"
yandex_API="f60ca0c9-9813-4936-881f-e625597d9c7b"

welcome_message = '''Я - твой надежный гид по городам России! 🇷🇺 Здесь ты найдешь всю необходимую информацию ✉️ о любом городе нашей прекрасной страны.

Просто отправь мне название интересующего тебя города 🌃, и я с удовольствием расскажу тебе о нем, предоставлю краткую информацию и даже поделюсь фотографиями 📸 А если это один из крупных городов, то ты сможешь насладиться списком его известных достопримечательностей 🕌

Но это еще не все! Если тебя интересует погода 🌤 в выбранном городе, то я с радостью сообщу тебе актуальные метеорологические данные 🌠

А если тебе нужно найти ближайший магазин, то напиши название магазина и отправь мне свою геолокацию. Я найду ближайший магазин 🛒 по твоему запросу и отправлю тебе его название вместе с точкой на карте 🗺

Так что не теряй время 🕑 и начинай свое увлекательное путешествие по городам России 🇷🇺 вместе со мной! Приятного путешествия!'''

menu_message = '''Что умеет бот? 

1. Поиск информации о городе: 

Нажмите на кнопку [🏰 Найти информацию о городе]. Затем введите название города, который хотели бы найти. После этого бот отправит фотографии и краткую информацию. 

2. Погода в городе:

Если город был успешно найден, то в меню бота появится кнопка [⛅️ Хочу узнать погоду в городе X]. При нажатии на нее бот выведет температуру, влажность, скорость ветра и другие актуальные метеорологические данные 🌠

3. Информация о достопримечательностях: 

Для самых крупных городов доступен список известных мест для более подробного знакомства 🗽 Также бот состав кратчайший маршрут по ним 🗺

4. Поиск ближайшего магазина/организации:

Нажмите на кнопку [🍎 Поиск магазина/организации] . Затем введите название магазина/организации, которую хотите найти вблизи, и отправьте боту свою геолокацию 🌐'''